In [1]:
import pandas as pd
import numpy as np

# DataFrame 2

In [2]:
data ={'name':['Jason','Molly','Tina','Jake','Amy'],
      'age':[42,52,36,24,73],
      'preTestScore':[4,24,31,2,3],
      'postTestScore':[25,94,57,62,70]}
df = pd.DataFrame(data, columns=['name', 'age', 'preTestScore','postTestScore'])
df

    name  age  preTestScore  postTestScore
0  Jason   42             4             25
1  Molly   52            24             94
2   Tina   36            31             57
3   Jake   24             2             62
4    Amy   73             3             70

In [6]:
print(df['age'].sum())
print(df['preTestScore'].cumsum())   # 누적해서 합산
print(df['preTestScore'].describe())   # 해당 칼럼에 대한 정보

print(df['preTestScore'].var())
print(df['preTestScore'].std())
print(df['preTestScore'].skew())

227
0     4
1    28
2    59
3    61
4    64
Name: preTestScore, dtype: int64
count     5.000000
mean     12.800000
std      13.663821
min       2.000000
25%       3.000000
50%       4.000000
75%      24.000000
max      31.000000
Name: preTestScore, dtype: float64
186.7
13.663820841916802
0.7433452457326751

In [8]:
print(df.corr())   # 상관관계(자주사용) 추후 설명

                    age  preTestScore  postTestScore
age            1.000000     -0.105651       0.328852
preTestScore  -0.105651      1.000000       0.378039
postTestScore  0.328852      0.378039       1.000000

### Data Cleaning

#### .unique()

In [9]:
stock_price_DF_withindex = pd.DataFrame(
    [10000,10300,9900,10500,11000], 
    index=["2020-03-01","2020-03-02","2020-03-03","2020-03-04","2020-03-5"])
stock_price_DF_withindex.rename(columns={0:"시가"}, inplace=True)
stock_price_DF_withindex["종가"]=[11000,12000,10000,13000,12000]
stock_price_DF_withindex["고가"]=[13000,15000,15000,18000,17000]
stock_price_DF_withindex["저가"]=[3000,5000,5000,8000,7000]
stock_price_DF_withindex

               시가     종가     고가    저가
2020-03-01  10000  11000  13000  3000
2020-03-02  10300  12000  15000  5000
2020-03-03   9900  10000  15000  5000
2020-03-04  10500  13000  18000  8000
2020-03-5   11000  12000  17000  7000

In [11]:
stock_price_DF_withindex["저가"].unique()   # 해당 데이터에서 중복을 포함한 유일 값

array([3000, 5000, 8000, 7000], dtype=int64)

In [12]:
len(stock_price_DF_withindex["저가"].unique())

4

In [14]:
# 사용 예
len(stock_price_DF_withindex["저가"]) == len(stock_price_DF_withindex["저가"].unique())

False

#### .dropna()

In [22]:
from numpy import nan as NA
data = pd.DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [29]:
# NA가 하나라도 포함되어 있으면 drop
data.dropna(axis=0)

     0    1    2
0  1.0  6.5  3.0

#### .dropna(thresh=1) : NA이 아닌 정상이 1개 이상이면 drop하지 않음

In [30]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0 -2.281845       NaN       NaN
1  1.401712       NaN       NaN
2  0.821044       NaN  0.548095
3 -0.523888       NaN  0.844942
4 -2.034169  0.846735  0.029992
5  0.571047 -1.229923 -0.280236
6 -0.576040 -0.140933 -0.995049

In [33]:
df.dropna(thresh=2)

          0         1         2
2  0.821044       NaN  0.548095
3 -0.523888       NaN  0.844942
4 -2.034169  0.846735  0.029992
5  0.571047 -1.229923 -0.280236
6 -0.576040 -0.140933 -0.995049

In [35]:
df.dropna(thresh=4, axis=1)

          0         2
0 -2.281845       NaN
1  1.401712       NaN
2  0.821044  0.548095
3 -0.523888  0.844942
4 -2.034169  0.029992
5  0.571047 -0.280236
6 -0.576040 -0.995049

#### .fillna(value)

In [37]:
df.fillna(1000)   # 모든 NA 가 1000으로 바뀌는 단점

          0            1            2
0 -2.281845  1000.000000  1000.000000
1  1.401712  1000.000000  1000.000000
2  0.821044  1000.000000     0.548095
3 -0.523888  1000.000000     0.844942
4 -2.034169     0.846735     0.029992
5  0.571047    -1.229923    -0.280236
6 -0.576040    -0.140933    -0.995049

In [40]:
df.fillna({1:99,2:-99})   # dictionary 구조로 칼럼별로 변경

# df.fillna({3:-99}) => 에러가 발생하지 않으니 세세한 확인 필요

          0          1          2
0 -2.281845  99.000000 -99.000000
1  1.401712  99.000000 -99.000000
2  0.821044  99.000000   0.548095
3 -0.523888  99.000000   0.844942
4 -2.034169   0.846735   0.029992
5  0.571047  -1.229923  -0.280236
6 -0.576040  -0.140933  -0.995049